'''
Вивести номер координатної чверті, в яку потрапляє точка із координатами x і y (xy ≠ 0)
'''
#позначення
'''
x - перша координата - float
y - друга координата - float
'''
#Введення
x = float(input("Введіть першу координату "))
y = float(input("Введіть другу координату "))
#визначення чверті
if  x > 0  :
    if y > 0 :
        print("перша чверть")
    else :
        print("четверта чверть")
else :
    if y > 0 :
        print("друга чверть")
    else :
        print("третя чверть")





